#!/usr/bin/python
# Python不支持单字符类型，单字符在 Python 中也是作为一个字符串使用。
# Python访问子字符串，可以使用方括号来截取字符串，如下实例：

var1 = 'Hello World!'
var2 = "Python Runoob"

print("var1[0]: ", var1[0])
print("var2[1:5]: ", var2[1:5])

# ```````````````````````````````````````````````````````````````````````````````````````````````````````````````````

#!/usr/bin/python
# -*- coding: UTF-8 -*-

var1 = 'Hello World!'
print("更新字符串 :-",var1[:6]+ 'Runoob!')
# ```````````````````````````````````````````````````````````````````````````````````````````````````````````````````

a = "Hello"
b = "Python"

print("a + b 输出结果：", a + b)
print ("a * 2 输出结果：", a * 2)
print ("a[1] 输出结果：", a[1])
print ("a[1:4] 输出结果：", a[1:4])

if( "H" in a) :
    print ("H 在变量 a 中")
else :
    print ("H 不在变量 a 中")

if( "M" not in a) :
    print ("M 不在变量 a 中")
else :
    print ("M 在变量 a 中")

# 原始字符串 - 原始字符串：所有的字符串都是直接按照字面的意思来使用，没有转义特殊或不能打印的字符。
# 原始字符串除在字符串的第一个引号前加上字母"r"（可以大小写）以外，与普通字符串有着几乎完全相同的语法。
print (r'\n')
print (R'\n')

# ``````````````````````````````````````````````````````````````````````````````````````````````````````````````````
# 在 Python 中，字符串格式化使用与 C 中 sprintf 函数一样的语法。
print("My name is %s and weight is %d kg!" % ('Zara', 21))

# ``````````````````````````````````````````````````````````````````````````````````````````````````````````````````

# python中三引号可以将复杂的字符串进行复制:
# python三引号允许一个字符串跨多行，字符串中可以包含换行符、制表符以及其他特殊字符
hi = '''hi
there'''
print (hi)   # repr()
'hi\nthere'
print (hi)  # str()

# ``````````````````````````````````````````````````````````````````````````````````````````````````````````````````